MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX450F256L.atdf
   <module caption="" id="01618" name="GPIO" version="">
      <register-group name="GPIO">
         <register caption="" name="ANSELA" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSELA" />
            <bitfield mask="0x00000002" name="ANSELA" />
            <bitfield mask="0x00000004" name="ANSELA" />
            <bitfield mask="0x00000008" name="ANSELA" />
            <bitfield mask="0x00000010" name="ANSELA" />
            <bitfield mask="0x00000020" name="ANSELA" />
            <bitfield mask="0x00000040" name="ANSELA" />
            <bitfield mask="0x00000080" name="ANSELA" />
            <bitfield mask="0x00000100" name="ANSELA" />
            <bitfield mask="0x00000200" name="ANSELA" />
            <bitfield mask="0x00000400" name="ANSELA" />
            <bitfield mask="0x00000800" name="ANSELA" />
            <bitfield mask="0x00001000" name="ANSELA" />
            <bitfield mask="0x00002000" name="ANSELA" />
            <bitfield mask="0x00004000" name="ANSELA" />
            <bitfield mask="0x00008000" name="ANSELA" />
         </register>
         <register caption="" name="ANSELB" offset="0x100" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSELB" />
            <bitfield mask="0x00000002" name="ANSELB" />
            <bitfield mask="0x00000004" name="ANSELB" />
            <bitfield mask="0x00000008" name="ANSELB" />
            <bitfield mask="0x00000010" name="ANSELB" />
            <bitfield mask="0x00000020" name="ANSELB" />
            <bitfield mask="0x00000040" name="ANSELB" />
            <bitfield mask="0x00000080" name="ANSELB" />
            <bitfield mask="0x00000100" name="ANSELB" />
            <bitfield mask="0x00000200" name="ANSELB" />
            <bitfield mask="0x00000400" name="ANSELB" />
            <bitfield mask="0x00000800" name="ANSELB" />
            <bitfield mask="0x00001000" name="ANSELB" />
            <bitfield mask="0x00002000" name="ANSELB" />
            <bitfield mask="0x00004000" name="ANSELB" />
            <bitfield mask="0x00008000" name="ANSELB" />
         </register>
         <register caption="" name="ANSELC" offset="0x200" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSELC" />
            <bitfield mask="0x00000002" name="ANSELC" />
            <bitfield mask="0x00000004" name="ANSELC" />
            <bitfield mask="0x00000008" name="ANSELC" />
            <bitfield mask="0x00000010" name="ANSELC" />
            <bitfield mask="0x00000020" name="ANSELC" />
            <bitfield mask="0x00000040" name="ANSELC" />
            <bitfield mask="0x00000080" name="ANSELC" />
            <bitfield mask="0x00000100" name="ANSELC" />
            <bitfield mask="0x00000200" name="ANSELC" />
            <bitfield mask="0x00000400" name="ANSELC" />
            <bitfield mask="0x00000800" name="ANSELC" />
            <bitfield mask="0x00001000" name="ANSELC" />
            <bitfield mask="0x00002000" name="ANSELC" />
            <bitfield mask="0x00004000" name="ANSELC" />
            <bitfield mask="0x00008000" name="ANSELC" />
         </register>
         <register caption="" name="ANSELD" offset="0x300" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSELD" />
            <bitfield mask="0x00000002" name="ANSELD" />
            <bitfield mask="0x00000004" name="ANSELD" />
            <bitfield mask="0x00000008" name="ANSELD" />
            <bitfield mask="0x00000010" name="ANSELD" />
            <bitfield mask="0x00000020" name="ANSELD" />
            <bitfield mask="0x00000040" name="ANSELD" />
            <bitfield mask="0x00000080" name="ANSELD" />
            <bitfield mask="0x00000100" name="ANSELD" />
            <bitfield mask="0x00000200" name="ANSELD" />
            <bitfield mask="0x00000400" name="ANSELD" />
            <bitfield mask="0x00000800" name="ANSELD" />
            <bitfield mask="0x00001000" name="ANSELD" />
            <bitfield mask="0x00002000" name="ANSELD" />
            <bitfield mask="0x00004000" name="ANSELD" />
            <bitfield mask="0x00008000" name="ANSELD" />
         </register>
         <register caption="" name="ANSELE" offset="0x400" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSELE" />
            <bitfield mask="0x00000002" name="ANSELE" />
            <bitfield mask="0x00000004" name="ANSELE" />
            <bitfield mask="0x00000008" name="ANSELE" />
            <bitfield mask="0x00000010" name="ANSELE" />
            <bitfield mask="0x00000020" name="ANSELE" />
            <bitfield mask="0x00000040" name="ANSELE" />
            <bitfield mask="0x00000080" name="ANSELE" />
            <bitfield mask="0x00000100" name="ANSELE" />
            <bitfield mask="0x00000200" name="ANSELE" />
            <bitfield mask="0x00000400" name="ANSELE" />
            <bitfield mask="0x00000800" name="ANSELE" />
            <bitfield mask="0x00001000" name="ANSELE" />
            <bitfield mask="0x00002000" name="ANSELE" />
            <bitfield mask="0x00004000" name="ANSELE" />
            <bitfield mask="0x00008000" name="ANSELE" />
         </register>
         <register caption="" name="ANSELF" offset="0x500" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSELF" />
            <bitfield mask="0x00000002" name="ANSELF" />
            <bitfield mask="0x00000004" name="ANSELF" />
            <bitfield mask="0x00000008" name="ANSELF" />
            <bitfield mask="0x00000010" name="ANSELF" />
            <bitfield mask="0x00000020" name="ANSELF" />
            <bitfield mask="0x00000040" name="ANSELF" />
            <bitfield mask="0x00000080" name="ANSELF" />
            <bitfield mask="0x00000100" name="ANSELF" />
            <bitfield mask="0x00000200" name="ANSELF" />
            <bitfield mask="0x00000400" name="ANSELF" />
            <bitfield mask="0x00000800" name="ANSELF" />
            <bitfield mask="0x00001000" name="ANSELF" />
            <bitfield mask="0x00002000" name="ANSELF" />
            <bitfield mask="0x00004000" name="ANSELF" />
            <bitfield mask="0x00008000" name="ANSELF" />
         </register>
         <register caption="" name="ANSELG" offset="0x600" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSELG" />
            <bitfield mask="0x00000002" name="ANSELG" />
            <bitfield mask="0x00000004" name="ANSELG" />
            <bitfield mask="0x00000008" name="ANSELG" />
            <bitfield mask="0x00000010" name="ANSELG" />
            <bitfield mask="0x00000020" name="ANSELG" />
            <bitfield mask="0x00000040" name="ANSELG" />
            <bitfield mask="0x00000080" name="ANSELG" />
            <bitfield mask="0x00000100" name="ANSELG" />
            <bitfield mask="0x00000200" name="ANSELG" />
            <bitfield mask="0x00000400" name="ANSELG" />
            <bitfield mask="0x00000800" name="ANSELG" />
            <bitfield mask="0x00001000" name="ANSELG" />
            <bitfield mask="0x00002000" name="ANSELG" />
            <bitfield mask="0x00004000" name="ANSELG" />
            <bitfield mask="0x00008000" name="ANSELG" />
         </register>
