MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX450F256L.atdf
      <value-group caption="Enable Interrupt Events via SPITUR bit" name="SPI1CON2__SPITUREN">
         <value caption="Transmit Underrun Generates Error Events" name="" value="0x1" />
         <value caption="Transmit Underrun Does Not Generates Error Events" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Interrupt Events via SPIROV bit" name="SPI1CON2__SPIROVEN">
         <value caption="Receive overflow generates error events" name="" value="0x1" />
         <value caption="Receive overflow does not generate error events" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Interrupt Events via FRMERR bit" name="SPI1CON2__FRMERREN">
         <value caption="Frame Error overflow generates error events" name="" value="0x1" />
         <value caption="Frame Error does not generate error events" name="" value="0x0" />
      </value-group>
      <value-group caption="Sign Extend Read Data from the RX FIFO bit" name="SPI1CON2__SPISGNEXT">
         <value caption="Data from RX FIFO is sign extended" name="" value="0x1" />
         <value caption="Data from RX FIFO is not sign extened" name="" value="0x0" />
      </value-group>
      <value-group caption="Audio Protocol Mode bit" name="SPI2CON2__AUDMOD">
         <value caption="PCM/DSP mode" name="" value="0x3" />
         <value caption="Right Justified mode" name="" value="0x2" />
         <value caption="Left Justified mode" name="" value="0x1" />
         <value caption="I2S mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Audio Data Format bit" name="SPI2CON2__AUDMONO">
         <value caption="Audio data is mono (Each data word is transmitted on both left and right channels)" name="" value="0x1" />
         <value caption="Audio data is stereo" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Audio CODEC Support bit" name="SPI2CON2__AUDEN">
         <value caption="Audio protocol enabled" name="" value="0x1" />
         <value caption="Audio protocol disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Ignore Transmit Underrun bit" name="SPI2CON2__IGNTUR">
         <value caption="A TUR is not a critical error and zeros are transmitted until the SPIxTXB is not empty" name="" value="0x1" />
         <value caption="A TUR is a critical error which stop SPI operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Ignore Receive Overflow bit" name="SPI2CON2__IGNROV">
         <value caption="A ROV is not a critical error; during ROV data in the fifo is not overwritten by receive data" name="" value="0x1" />
         <value caption="A ROV is a critical error which stop SPI operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Interrupt Events via SPITUR bit" name="SPI2CON2__SPITUREN">
         <value caption="Transmit Underrun Generates Error Events" name="" value="0x1" />
         <value caption="Transmit Underrun Does Not Generates Error Events" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Interrupt Events via SPIROV bit" name="SPI2CON2__SPIROVEN">
         <value caption="Receive overflow generates error events" name="" value="0x1" />
         <value caption="Receive overflow does not generate error events" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Interrupt Events via FRMERR bit" name="SPI2CON2__FRMERREN">
         <value caption="Frame Error overflow generates error events" name="" value="0x1" />
         <value caption="Frame Error does not generate error events" name="" value="0x0" />
      </value-group>
      <value-group caption="Sign Extend Read Data from the RX FIFO bit" name="SPI2CON2__SPISGNEXT">
         <value caption="Data from RX FIFO is sign extended" name="" value="0x1" />
         <value caption="Data from RX FIFO is not sign extened" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00687" name="TMR1" version="1">
      <register-group name="TMR1">
         <register caption="TYPE A TIMER CONTROL REGISTER" name="T1CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Timer Clock Source Select bit" mask="0x00000002" name="TCS" values="T1CON__TCS" />
            <bitfield caption="Timer External Clock Input Synchronization Selection bit" mask="0x00000004" name="TSYNC" values="T1CON__TSYNC" />
            <bitfield caption="Timer Input Clock Prescale Select bits" mask="0x00000030" name="TCKPS" values="T1CON__TCKPS" />
            <bitfield caption="Timer Gated Time Accumulation Enable bit" mask="0x00000080" name="TGATE" values="T1CON__TGATE" />
            <bitfield caption="Asynchronous Timer Write in Progress bit" mask="0x00000800" name="TWIP" values="T1CON__TWIP" />
            <bitfield caption="Asynchronous Timer Write Disable bit" mask="0x00001000" name="TWDIS" values="T1CON__TWDIS" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="T1CON__SIDL" />
            <bitfield caption="Timer On bit" mask="0x00008000" name="ON" values="T1CON__ON" />
         </register>
         <register caption="" name="TMR1" offset="0x10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="TMR1" />
         </register>
         <register caption="" name="PR1" offset="0x20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="PR1" />
         </register>
      </register-group>
      <value-group caption="Timer Clock Source Select bit" name="T1CON__TCS">
         <value caption="External clock from T1CKI pin" name="" value="0x1" />
         <value caption="Internal peripheral clock" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer External Clock Input Synchronization Selection bit" name="T1CON__TSYNC">
         <value caption="(When TCS is 1) External clock input is synchronized / (When TCS is 0) bit is ignored" name="" value="0x1" />
         <value caption="(When TCS is 1) External clock input is not synchronized / (When TCS is 0) bit is ignored" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer Input Clock Prescale Select bits" name="T1CON__TCKPS">
         <value caption="1:256 prescale value" name="" value="0x3" />
         <value caption="1:64 prescale value" name="" value="0x2" />
         <value caption="1:8 prescale value" name="" value="0x1" />
         <value caption="1:1 prescale value" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer Gated Time Accumulation Enable bit" name="T1CON__TGATE">
         <value caption="(When TCS is 0) Gated time accumulation is enabled / (When TCS is 1) bit is ignored" name="" value="0x1" />
         <value caption="(When TCS is 0) Gated time accumulation is disabled / (When TCS is 1) bit is ignored" name="" value="0x0" />
      </value-group>
      <value-group caption="Asynchronous Timer Write in Progress bit" name="T1CON__TWIP">
         <value caption="(In Asynchronous Timer mode) Asynchronous write to TMR1 register in progress / (in synchronous mode) read as 0" name="" value="0x1" />
         <value caption="(In Asynchronous Timer mode) Asynchronous write to TMR1 register complete / (in synchronous mode) read as 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Asynchronous Timer Write Disable bit" name="T1CON__TWDIS">
         <value caption="Writes to TMR1 are ignored until pending write operation completes" name="" value="0x1" />
         <value caption="Back-to-back writes are enabled (Legacy Asynchronous Timer functionality)" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="T1CON__SIDL">
         <value caption="Discontinue operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue operation even in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer On bit" name="T1CON__ON">
         <value caption="Timer is enabled" name="" value="0x1" />
         <value caption="Timer is disabled" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00745" name="TMR" version="1">
      <register-group name="TMR">
         <register caption="Type B Timer Control Register" name="T2CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Timer Clock Source Select bit" mask="0x00000002" name="TCS" values="T2CON__TCS" />
            <bitfield caption="32-Bit Timer Mode Select bit" mask="0x00000008" name="T32" values="T2CON__T32" />
            <bitfield caption="Timer Input Clock Prescale Select bits" mask="0x00000070" name="TCKPS" values="T2CON__TCKPS" />
            <bitfield caption="Timer Gated Time Accumulation Enable bit" mask="0x00000080" name="TGATE" values="T2CON__TGATE" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="T2CON__SIDL" />
            <bitfield caption="Timer On bit" mask="0x00008000" name="ON" values="T2CON__ON" />
         </register>
         <register caption="Type B Timer Control Register" name="T3CON" offset="0x200" rw="RW" size="4">
            <bitfield caption="Timer Clock Source Select bit" mask="0x00000002" name="TCS" values="T3CON__TCS" />
            <bitfield caption="32-Bit Timer Mode Select bit" mask="0x00000008" name="T32" values="T3CON__T32" />
            <bitfield caption="Timer Input Clock Prescale Select bits" mask="0x00000070" name="TCKPS" values="T3CON__TCKPS" />
            <bitfield caption="Timer Gated Time Accumulation Enable bit" mask="0x00000080" name="TGATE" values="T3CON__TGATE" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="T3CON__SIDL" />
            <bitfield caption="Timer On bit" mask="0x00008000" name="ON" values="T3CON__ON" />
         </register>
         <register caption="Type B Timer Control Register" name="T4CON" offset="0x400" rw="RW" size="4">
            <bitfield caption="Timer Clock Source Select bit" mask="0x00000002" name="TCS" values="T4CON__TCS" />
            <bitfield caption="32-Bit Timer Mode Select bit" mask="0x00000008" name="T32" values="T4CON__T32" />
            <bitfield caption="Timer Input Clock Prescale Select bits" mask="0x00000070" name="TCKPS" values="T4CON__TCKPS" />
            <bitfield caption="Timer Gated Time Accumulation Enable bit" mask="0x00000080" name="TGATE" values="T4CON__TGATE" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="T4CON__SIDL" />
            <bitfield caption="Timer On bit" mask="0x00008000" name="ON" values="T4CON__ON" />
         </register>
